In [1]:
import pandas as pd
import numpy as np

In [3]:
data1 = pd.read_csv('/content/HW19.csv')

In [4]:
data1.head(5)

         nim          nama  semester                 mata_kuliah  nilai
0  101621001  Rimala Kumar         6           Kecerdasan Buatan     74
1  101621001  Rimala Kumar         6    Pengolahan Citra Digital     73
2  101621001  Rimala Kumar         6  Sistem Informasi Geografis     67
3  101621001  Rimala Kumar         7     Pengantar Studi Pustaka     92
4  101621001  Rimala Kumar         7                    Kolokium     92

##a. Menampilkan nim, nama, beserta semester berjalan untuk masing-masing mahasiswa dalam data1 yang terurut berdasarkan nim secara ascending.

In [5]:
a = data1.groupby(['nim', 'nama']).agg(semester = ('semester', 'max'))
a.head()

                          semester
nim       nama
101621001 Rimala Kumar           8
101621002 Citra Tenggara         8
101621003 Rani Kumala            6
101621004 Junaedi                6
101621005 Kameela Malik          3

##b. Menampilkan nilai rata-rata, nilai maksimal, dan nilai minimal kelas per semester yang diurutkan berdasarkan semester secara descending.

In [6]:
b = data1.groupby('semester').agg(
    rata_rata = ('nilai', 'mean'),
    maksimal = ('nilai', 'max'),
    minimal = ('nilai', 'min')
).sort_values(by='semester', ascending=False)
b.head()

          rata_rata  maksimal  minimal
semester
8         91.500000        94       89
7         89.250000        92       86
6         77.545455        93       59
5         80.833333        91       53
4         67.000000        70       64

##c. Menampilkan nilai rata-rata, nilai maksimal, dan nilai minimal untuk setiap mata kuliah per semester yang diurutkan berdasarkan semester dan mata kuliah secara ascending.

In [7]:
c = data1.groupby(['mata_kuliah', 'semester']).agg(
    rata_rata = ('nilai', 'mean'),
    maksimal = ('nilai', 'max'),
    minimal = ('nilai', 'min')
).sort_values(by=(['semester', 'mata_kuliah']), ascending=True)
c.head(8)

                                rata_rata  maksimal  minimal
mata_kuliah           semester
Dasar Komputer        1         88.500000        90       87
Ekonomi Umum          1         77.000000        86       68
Pengantar Matematika  1         63.666667        88       46
Kalkulus1             2         72.500000        87       58
Kewirausahaan         2         90.000000        90       90
Pengantar Statistika  2         64.500000        79       50
Algoritma Pemrograman 3         76.000000        76       76
Basis Data            3         79.500000        90       69

##d. Menampilkan nilai rata-rata, nilai maksimal, dan nilai minimal untuk setiap mahasiswa dan setiap semester yang diurutkan berdasarkan NIM secara ascending.

In [8]:
d = data1.groupby(['nim', 'nama', 'semester']).agg(
    rata_rata = ('nilai', 'mean'),
    maksimal = ('nilai', 'max'),
    minimal = ('nilai', 'min')
).sort_values(by=(['nim']), ascending=True)
d.head(20)

                                   rata_rata  maksimal  minimal
nim       nama           semester
101621001 Rimala Kumar   6         71.333333        74       67
                         7         92.000000        92       92
                         8         89.000000        89       89
101621002 Citra Tenggara 6         84.500000        93       75
                         7         86.500000        87       86
                         8         94.000000        94       94
101621003 Rani Kumala    5         89.333333        91       87
                         6         81.500000        82       81
101621004 Junaedi        6         69.000000        79       59
                         5         72.333333        84       53
101621005 Kameela Malik  1         46.000000        46       46
                         2         66.000000        90       50
                         3         67.500000        69       66
101621006 Ajeng Jameela  3         81.333333        90       76
                         4         67.000000        70       64
101621007 Dodi Adiyat    1         70.666667        87       57
101621008 Lora Zanara    1         88.000000        90       86
                         2         83.000000        87       79

### **Created by** : Jamaludin Arif Rohman